tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "bat"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "libgit2"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "jq"
brew "lazygit"
brew "libyaml"
brew "luarocks"
brew "mvfst"
brew "neovim"
brew "python@3.12"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "wabt"
brew "watchman"
cask "android-studio"
cask "wezterm"
cask "zulu@17"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "celianriboulet.webvalidator"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "glenn2223.live-sass"
vscode "hbenl.vscode-test-explorer"
vscode "jscearcy.rust-doc-viewer"
vscode "leizongmin.node-module-intellisense"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "msjsdiag.vscode-react-native"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
